rikkapro0128/system_node_esp32_iot/src/main.cpp
  digitalWrite(STATUS_PIN_START, LOW);
  digitalWrite(STATUS_PIN_WIFI, LOW);
}

uint32_t Wheel(byte WheelPos)
{
  WheelPos = 255 - WheelPos;
  if (WheelPos < 85)
  {
    return strip.Color(255 - WheelPos * 3, 0, WheelPos * 3);
  }
  if (WheelPos < 170)
  {
    WheelPos -= 85;
    return strip.Color(0, WheelPos * 3, 255 - WheelPos * 3);
  }
  WheelPos -= 170;
  return strip.Color(WheelPos * 3, 255 - WheelPos * 3, 0);
}

bool fadeColor(INDEX_COLOR index)
{
  if (colorPresentState[index] > colorFultureState[index])
  {
    colorPresentState[index] = --colorPresentState[index];
    return true;
  }
  else if (colorPresentState[index] < colorFultureState[index])
  {
    colorPresentState[index] = ++colorPresentState[index];
    return true;
  }
  else
  {
    return false;
  }
}

void setColorChainRGBA(uint32_t c, uint8_t a)
{
  for (uint16_t i = 0; i < strip.numPixels(); i++)
  {
    strip.setPixelColor(i, c);
  }
  strip.setBrightness(a);
  strip.show();
}

void clearEffectColor(uint8_t brightness)
{
  strip.setBrightness(brightness);
  for (uint16_t i = 0; i < strip.numPixels(); i++)
  {
    strip.setPixelColor(i, strip.Color(0, 0, 0));
    strip.show();
    delay(10);
  }
  colorPresentState[0] = 0;
  colorPresentState[1] = 0;
  colorPresentState[2] = 0;
  colorPresentState[3] = 0;
  acceptChange = true;
}

void parserColorRGB(FirebaseStream &data, String prefix)
{
  data.jsonObject().get(deviceJson, prefix + "r");
  uint8_t colorR = deviceJson.to<int>();
  colorFultureState[0] = colorR;
  deviceJson.clear();
  data.jsonObject().get(deviceJson, prefix + "g");
  uint8_t colorG = deviceJson.to<int>();
  colorFultureState[1] = colorG;
  deviceJson.clear();
  data.jsonObject().get(deviceJson, prefix + "b");
  uint8_t colorB = deviceJson.to<int>();
  colorFultureState[2] = colorB;
  deviceJson.clear();
  data.jsonObject().get(deviceJson, prefix + "contrast");
  uint8_t alpha = deviceJson.to<int>();
  colorFultureState[3] = alpha;
  deviceJson.clear();
  acceptChange = true;
}

uint8_t parserColorStyle(FirebaseStream &data, bool init)
{
  if (init)
  {
    data.jsonObject().get(deviceJson, "mode");
    return deviceJson.to<uint8_t>();
  }
  else
  {
    return data.to<uint8_t>();
  }
}

#endif
/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* {START} DEFINE FUNCTION GENERAL *********]
 *
 */

float_t ramHeapSize()
{
  uint32_t ramSize = ESP.getFreeHeap();
  return (float_t)(ramSize / ESP.getFlashChipSize() * 100);
}

void clearBufferFirebaseDataAll()
{
  fbdoStream.clear();
  fbdoControl.clear();
  createNode.clear();
}

void setupStreamFirebase()
{
  Firebase.RTDB.setStreamCallback(&fbdoStream, streamCallback, streamTimeoutCallback);
  String pathStream;
#ifdef LOGIC
  pathStream = eeprom.DATABASE_NODE + "/devices";
#endif
#ifdef COLOR
  pathStream = eeprom.DATABASE_NODE + "/devices/device-" + GEN_ID_BY_MAC;
#ifdef _DEBUG_
  Serial.println("[DEBUG] Path Stream = " + pathStream);
#endif
#endif
  if (pathStream.length() > 0)
  {
    if (!Firebase.RTDB.beginStream(&fbdoStream, pathStream))
    {
#ifdef _DEBUG_
      Serial_Printf("stream begin error, %s\n\n", fbdoStream.errorReason().c_str());
#endif
    }
    else
    {
#ifdef _DEBUG_
      Serial.println(String("Stream OK!"));
#endif
    }
  }
}

void streamCallback(FirebaseStream data)
{
#ifdef _DEBUG_
  Serial_Printf("sream path, %s\nevent path, %s\ndata type, %s\nevent type, %s\n\n",
                data.streamPath().c_str(),
                data.dataPath().c_str(),
                data.dataType().c_str(),
                data.eventType().c_str());
  Serial.println();
  Serial_Printf("Received stream payload size: %d (Max. %d)\n\n", data.payloadLength(), data.maxPayloadLength());
#endif
  String dataPath = data.dataPath();
  uint8_t dataType = data.dataTypeEnum();
#ifdef LOGIC
  uint8_t numDevice = (uint8_t)(dataPath.substring(21, 22).toInt());
  if (dataType == d_boolean)
  {
    if (dataPath.indexOf("state") > 0 || numDevice) // execute controll turn on device by [INDEX]
    {
      if (data.dataTypeEnum() == fb_esp_rtdb_data_type_boolean)
      {
        bool state = data.to<boolean>();
        if (!blockControl)
        {
          controllDevice(numDevice, state);
        }
      }
    }
  }
  else if (dataType == d_json)
  {
    if (dataPath.equals("/") && isFirst)
    { // execute init state all device
#ifdef _DEBUG_
      Serial.println("Init Status");
#endif
      parserTimerJson(data, 1);
      parserTimerJson(data, 2);
      parserTimerJson(data, 3);

      sortTimer(timerStack, indexTimerStack);

      parserDeviceStatus(data, 1);
      parserDeviceStatus(data, 2);
      parserDeviceStatus(data, 3);
      timeControll = true;
      isFirst = false;
    }
    else if (dataPath.indexOf("timer") > 0 && numDevice)
    {
      parserTimerJson(data, numDevice, false); // add timer to list timer
      sortTimer(timerStack, indexTimerStack);
      timeControll = true;
    }
#ifdef _DEBUG_
    PrintListTimer();
#endif
  }
  else if (dataType == d_null)
  {
    removeTimer(timerStack, indexTimerStack, dataPath.substring(29, 49), true);
#ifdef _DEBUG_
    PrintListTimer();
#endif
  }
#endif
#ifdef COLOR

  if (dataType == d_json)
  {
    if (dataPath == "/")
    {
      modeRGB = parserColorStyle(data, true);

#ifdef _DEBUG_
      Serial.println("[DEBUG] Data Mode Color = " + String(modeRGB));
#endif
      eeprom.saveStyleColor(modeRGB);
      if (modeRGB == SINGLE)
      {
        // Parser Data led RGB here

#ifdef _DEBUG_
        Serial.println("[DEBUG] Data Color = " + data.jsonString());
#endif
        parserColorRGB(data, "value/");
      }
    }
    else if (dataPath.indexOf("value") > 0)
    {

#ifdef _DEBUG_
      Serial.println("[DEBUG] Data Color = " + data.jsonString());
#endif
      parserColorRGB(data);
    }
  }
  else if (dataType == d_integer)
  {
    if (dataPath.indexOf("mode") > 0)
    {
      modeRGB = parserColorStyle(data);
      eeprom.saveStyleColor(modeRGB);
      clearEffect = true;

#ifdef _DEBUG_
      Serial.println("[DEBUG] Data Mode Color = " + String(modeRGB));
#endif
    }
  }

#endif
}

void streamTimeoutCallback(bool timeout)
{
#ifdef _DEBUG_
  if (timeout)
  {
    Serial.println("Stream timed out, resuming...\n");
  }
  if (!fbdoStream.httpConnected())
  {
    Serial_Printf("error code: %d, reason: %s\n\n", fbdoStream.httpCode(), fbdoStream.errorReason().c_str());
  }
#endif
}

